ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78InsertExchangeInstructions.cpp
//===- RL78InsertExchangeInstructions.cpp - Define TargetMachine for RL78 -===//
//
// Part of the LLVM Project, under the Apache License v2.0 with LLVM Exceptions.
// See https://llvm.org/LICENSE.txt for license information.
// SPDX-License-Identifier: Apache-2.0 WITH LLVM-exception
//
//===----------------------------------------------------------------------===//
//
//
//===----------------------------------------------------------------------===//
// TODO: Revisit this whole file, maybe move some of xch to ISelLowering
#include "RL78TargetMachine.h"

using namespace llvm;

#define DEBUG_TYPE "insert-exchange"

namespace {
class RL78InsertExchangeInstructionsPass : public MachineFunctionPass {
public:
  RL78InsertExchangeInstructionsPass() : MachineFunctionPass(ID) {}

  StringRef getPassName() const override {
    return "RL78 insert exchange instructions";
  }

  bool runOnMachineFunction(MachineFunction &MF) override;

  // private:
  static char ID;
};

char RL78InsertExchangeInstructionsPass::ID = 0;
} // end anonymous namespace

FunctionPass *llvm::createRL78InsertExchangeInstructionsPass() {
  return new RL78InsertExchangeInstructionsPass();
}

namespace llvm {
void initializeRL78InsertExchangeInstructionsPassPass(PassRegistry &);
}

// if operand(opIndex) is NOT A register (and it needs to be) we need to
// exchange the value to A and back in other words generate the following
// sequence: xch A, Rx op A, <...> xch A, Rx
static void insert8BitExchange(MachineInstr &MI, unsigned opIndex, DebugLoc &DL,
                               MachineBasicBlock &MBB,
                               const TargetInstrInfo *TII, bool isALive,
                               bool isDefOp0 = true) {
  // MBB.dump();
  // MI.dump();

  if (opIndex == 0 && MI.getOpcode() != RL78::XCH_A_r &&
      MI.getOperand(opIndex).isTied()) {
    if ((!isALive) && MI.getOperand(opIndex + 1).isKill()) {
      BuildMI(MBB, MI, DL, TII->get(RL78::MOV_A_r), RL78::R1)
          .addReg(MI.getOperand(opIndex).getReg(), RegState::Kill);
    }
  }

  // if dest is NOT A register we need to exchange the value to A and back
  if (!RL78::RL78ARegRegClass.contains(MI.getOperand(opIndex).getReg())) {
    // if the operand is "Kill"
    if ((!isALive) && MI.getOperand(opIndex).isKill()) {
      BuildMI(MBB, MI, DL, TII->get(RL78::MOV_A_r), RL78::R1)
          .addReg(MI.getOperand(opIndex).getReg(), RegState::Kill);
    }
    // if register is "Def"
    else if ((!isALive) && MI.getOperand(opIndex).isDef()) {
      BuildMI(MBB, std::next(MI.getIterator()), DL, TII->get(RL78::MOV_r_A),
              MI.getOperand(opIndex).getReg())
          .addReg(RL78::R1, RegState::Kill);
    } else {
      // generate the following sequence:
      // xch A, Rx
      // op A, <...>
      // xch A, Rx
      BuildMI(MBB, MI, DL, TII->get(RL78::XCH_A_r), RL78::R1)
          .addReg(MI.getOperand(opIndex).getReg(), RegState::Define)
          .addReg(RL78::R1, RegState::Kill)
          .addReg(MI.getOperand(opIndex).getReg(), RegState::Kill);
      BuildMI(MBB, std::next(MI.getIterator()), DL, TII->get(RL78::XCH_A_r),
              RL78::R1)
          .addReg(MI.getOperand(opIndex).getReg(), RegState::Define)
          .addReg(RL78::R1, RegState::Kill)
          .addReg(MI.getOperand(opIndex).getReg(), RegState::Kill);
    }
  }
  //
  if (MI.getOpcode() != RL78::XCH_A_r) {
    MI.getOperand(opIndex).ChangeToRegister(RL78::R1, isDefOp0);
    // In case we have all 3 operands are equal.
    if (MI.getOpcode() == RL78::XOR_r_r || MI.getOpcode() == RL78::AND_r_r ||
        MI.getOpcode() == RL78::OR_r_r) {
      assert(MI.getOperand(opIndex).isTied());
      if (MI.getOperand(2).getReg() == MI.getOperand(1).getReg())
        MI.getOperand(2).ChangeToRegister(RL78::R1, false);
    }
    // is it tied to operand1?
    if ((opIndex == 0) && MI.getOperand(opIndex).isTied())
      MI.getOperand(1).ChangeToRegister(RL78::R1, false);
  } else {
    if (MI.getOperand(1).getReg() == RL78::R1) {
      MI.getOperand(1).ChangeToRegister(MI.getOperand(0).getReg(), true);
      MI.getOperand(3).ChangeToRegister(MI.getOperand(0).getReg(), true);
    }
    MI.getOperand(0).ChangeToRegister(RL78::R1, true);
    MI.getOperand(2).ChangeToRegister(RL78::R1, false);
  }
  // MBB.dump();
}

// if operand(opIndex) is NOT A register (and it needs to be) we need to
// exchange the value to A and back in other words generate the following
// sequence: xchw AX, RPx op AX, <...> xchw AX, RPx
static void insert16BitExchange(MachineInstr &MI, unsigned opIndex,
                                DebugLoc &DL, MachineBasicBlock &MBB,
                                const TargetInstrInfo *TII, bool isAXLive) {
  // MBB.dump();
  // MI.dump();
  unsigned Reg = MI.getOperand(opIndex).getReg();
  // if dest is NOT A register we need to exchange the value to A and back
  if (Reg != RL78::RP0) {
    // if the operand is "Kill"
    if ((!isAXLive) && MI.getOperand(opIndex).isKill()) {
      if (RL78::RL78BCDEHLRegClass.contains(Reg))
        BuildMI(MBB, MI, DL, TII->get(RL78::MOVW_AX_rp), RL78::RP0)
            .addReg(Reg, RegState::Kill);
      else
        BuildMI(MBB, MI, DL, TII->get(RL78::MOVW_AX_rp), RL78::RP0)
            .addReg(Reg, RegState::Kill);
    }
    // if register is "Def"
    else if ((!isAXLive) && MI.getOperand(opIndex).isDef()) {
      BuildMI(MBB, std::next(MI.getIterator()), DL, TII->get(RL78::MOVW_rp_AX),
              Reg)
          .addReg(RL78::RP0, RegState::Kill);
    } else {
      // generate the following sequence:
      // xchw AX, Rx
      // op AX, <...>
      // xchw A, Rx
      if (!MBB.getParent()->getRegInfo().isReserved(Reg) &&
          Reg != RL78::MACRH && Reg != RL78::MACRL) {
        BuildMI(MBB, MI, DL, TII->get(RL78::XCHW_AX_rp), RL78::RP0)
            .addReg(Reg, RegState::Define)
            .addReg(RL78::RP0, RegState::Kill)
            .addReg(Reg, RegState::Kill);
        BuildMI(MBB, std::next(MI.getIterator()), DL,
                TII->get(RL78::XCHW_AX_rp), RL78::RP0)
            .addReg(Reg, RegState::Define)
            .addReg(RL78::RP0, RegState::Kill)
            .addReg(Reg, RegState::Kill);
      } else {
        // TODO: revisit this!
        // TODO: we need a CFI_INSTRUCTION everywhere we a have a PUSH/POP
        BuildMI(MBB, MI, DL, TII->get(RL78::PUSH_rp))
            .addReg(RL78::RP0, RegState::Kill);
        BuildMI(MBB, MI, DL, TII->get(RL78::MOVW_AX_rp), RL78::RP0)
            .addReg(Reg, RegState::Kill);
        // OBS. the order of the next 2 instruction is not wrong, they will be
        // inserted in the right order
        BuildMI(MBB, std::next(MI.getIterator()), DL, TII->get(RL78::POP_rp),
                RL78::RP0);
        // Only if the operand is def we need to copy it back from AX.
        if (MI.getOperand(opIndex).isDef())
          BuildMI(MBB, std::next(MI.getIterator()), DL,
                  TII->get(RL78::MOVW_rp_AX), Reg)
              .addReg(RL78::RP0, RegState::Kill);
        // In case of stack operations we need to compensate for the stack
        // pointer change caused by PUSH(SP -= 2), but only when we arent
        // using the FP.
        bool isFpInUse = MBB.getParent()->getRegInfo().isReserved(RL78::RP6);
        if (MI.getOpcode() == RL78::STORE16_stack_slot_rp && !isFpInUse) {
          MI.getOperand(1).setImm(MI.getOperand(1).getImm() + 2);
        }
        if (MI.getOpcode() == RL78::LOAD16_rp_stack_slot && !isFpInUse) {
          MI.getOperand(2).setImm(MI.getOperand(2).getImm() + 2);
        }
      }
    }
  }
  //
  MI.getOperand(opIndex).ChangeToRegister(RL78::RP0,
                                          (opIndex == 0) ? true : false);
  // is it tied to operand1?
  if ((opIndex == 0) && MI.getOperand(opIndex).isTied())
    MI.getOperand(1).ChangeToRegister(RL78::RP0, false);
  // MBB.dump();
}

static void insertHLExchange(MachineInstr &MI, unsigned opIndex, DebugLoc &DL,
                             MachineBasicBlock &MBB,
                             const TargetInstrInfo *TII) {
  assert(MI.getOperand(opIndex).isReg());
  if (MI.getOperand(opIndex).getReg() != RL78::RP6) {
    unsigned badReg = MI.getOperand(opIndex).getReg();
    // TODO: CFA
    BuildMI(MBB, MI, DL, TII->get(RL78::PUSH_rp))
        .addReg(RL78::RP6, RegState::Kill);
    BuildMI(MBB, MI, DL, TII->get(RL78::PUSH_rp))
        .addReg(badReg, RegState::Kill);
    BuildMI(MBB, MI, DL, TII->get(RL78::POP_rp), RL78::RP6);
    MI.getOperand(opIndex).ChangeToRegister(RL78::RP6, false);
    // despite the order here, in the generated code it will be push hl, pop de,
    // pop hl
    BuildMI(MBB, std::next(MI.getIterator()), DL, TII->get(RL78::POP_rp))
        .addReg(RL78::RP6, RegState::Define);
    BuildMI(MBB, std::next(MI.getIterator()), DL, TII->get(RL78::POP_rp),
            badReg);
    BuildMI(MBB, std::next(MI.getIterator()), DL, TII->get(RL78::PUSH_rp))
        .addReg(RL78::RP6, RegState::Kill);
  }
}

static void updateAAXLiveness(const MachineInstr &MI, bool &isALive,
                              bool &isXLive) {
  if (MI.isKill()) {
    isALive = isXLive = true;
    return;
  }
  // first mark is(A/AX)Live as false if A/AX isKill
  for (unsigned idx = 0, e = MI.getNumOperands(); idx != e; ++idx) {
    if (MI.getOperand(idx).isReg() && MI.getOperand(idx).isKill()) {
      if (MI.getOperand(idx).getReg() == RL78::R1)
        isALive = false;
      if (MI.getOperand(idx).getReg() == RL78::R0)
        isXLive = false;
      else if (MI.getOperand(idx).getReg() == RL78::RP0)
        isXLive = isALive = false;
    }
  }

  // second mark is(A/AX)Live as true if A/AX isDef
  if (MI.getOpcode() == TargetOpcode::BUNDLE ||
      MI.getOpcode() == RL78::XCHW_AX_rp || 
      MI.getOpcode() == RL78::XCH_A_r || 
      MI.isCall()) {
    // Bundle instructions can have multiple defs
    // Call defs are not first
    for (unsigned idx = 0, e = MI.getNumOperands(); idx != e; ++idx) {
      if (MI.getOperand(idx).isReg() && MI.getOperand(idx).isDef() &&
          !MI.getOperand(idx).isDead()) {
        if (MI.getOperand(idx).getReg() == RL78::R1)
          isALive = true;
        if (MI.getOperand(idx).getReg() == RL78::R0)
          isXLive = true;
        else if (MI.getOperand(idx).getReg() == RL78::RP0)
          isXLive = isALive = true;
      }
    }
  } else {
    if (MI.getNumOperands() > 0 && MI.getOperand(0).isReg() &&
        MI.getOperand(0).isDef() && !MI.getOperand(0).isDead()) {
      if (MI.getOperand(0).getReg() == RL78::R1)
        isALive = true;
      if (MI.getOperand(0).getReg() == RL78::R0)
        isXLive = true;
      else if (MI.getOperand(0).getReg() == RL78::RP0)
        isALive = isXLive = true;
    }
  }
}

